cmsis-svd/cmsis-svd/data/Nuvoton/NUC131AE_v1.svd
       <register derivedFrom="CAN_IF1_MASK1">
          <name>CAN_IF2_MASK1</name>
          <displayName>CAN_IF2_MASK1</displayName>
          <description>IF2 Mask 1 Register</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_MASK2">
          <name>CAN_IF2_MASK2</name>
          <displayName>CAN_IF2_MASK2</displayName>
          <description>IF2 Mask 2 Register</description>
          <addressOffset>0x8C</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_ARB1">
          <name>CAN_IF2_ARB1</name>
          <displayName>CAN_IF2_ARB1</displayName>
          <description>IF2 Arbitration 1 Register</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_ARB2">
          <name>CAN_IF2_ARB2</name>
          <displayName>CAN_IF2_ARB2</displayName>
          <description>IF2 Arbitration 2 Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_MCON">
          <name>CAN_IF2_MCON</name>
          <displayName>CAN_IF2_MCON</displayName>
          <description>IF2 Message Control Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_DAT_A1">
          <name>CAN_IF2_DAT_A1</name>
          <displayName>CAN_IF2_DAT_A1</displayName>
          <description>IF2 Data A1 Register (Register Map Note 3)</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_DAT_A2">
          <name>CAN_IF2_DAT_A2</name>
          <displayName>CAN_IF2_DAT_A2</displayName>
          <description>IF2 Data A2 Register (Register Map Note 3)</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_DAT_B1">
          <name>CAN_IF2_DAT_B1</name>
          <displayName>CAN_IF2_DAT_B1</displayName>
          <description>IF2 Data B1 Register (Register Map Note 3)</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="CAN_IF1_DAT_B2">
          <name>CAN_IF2_DAT_B2</name>
          <displayName>CAN_IF2_DAT_B2</displayName>
          <description>IF2 Data B2 Register (Register Map Note 3)</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register>
          <name>CAN_TXREQ1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_TXREQ1</displayName>
          <description>Transmission Request Register 1</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxRqst16_1</name>
              <description>Transmission Request Bits 16-1 (Of All Message Objects)\nThese bits are read only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>This Message Object is not waiting for transmission</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The transmission of this Message Object is requested and is not yet done</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_TXREQ2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_TXREQ2</displayName>
          <description>Transmission Request Register 2</description>
          <addressOffset>0x104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TxRqst32_17</name>
              <description>Transmission Request Bits 32-17 (Of All Message Objects)\nThese bits are read only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>This Message Object is not waiting for transmission</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The transmission of this Message Object is requested and is not yet done</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_NDAT1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_NDAT1</displayName>
          <description>New Data Register 1</description>
          <addressOffset>0x120</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NewData16_1</name>
              <description>New Data Bits 16-1 (Of All Message Objects)\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No new data has been written into the data portion of this Message Object by the Message Handler since the last time this flag was cleared by the application software</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The Message Handler or the application software has written new data into the data portion of this Message Object</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_NDAT2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_NDAT2</displayName>
          <description>New Data Register 2</description>
          <addressOffset>0x124</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NewData32_17</name>
              <description>New Data Bits 32-17 (Of All Message Objects)\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No new data has been written into the data portion of this Message Object by the Message Handler since the last time this flag was cleared by the application software</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The Message Handler or the application software has written new data into the data portion of this Message Object</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_IPND1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_IPND1</displayName>
          <description>Interrupt Pending Register 1</description>
          <addressOffset>0x140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IntPnd16_1</name>
              <description>Interrupt Pending Bits 16-1 (Of All Message Objects)\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>This message object is not the source of an interrupt</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>This message object is the source of an interrupt</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_IPND2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_IPND2</displayName>
          <description>Interrupt Pending Register 2</description>
          <addressOffset>0x144</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IntPnd32_17</name>
              <description>Interrupt Pending Bits 32-17 (Of All Message Objects)\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>This message object is not the source of an interrupt</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>This message object is the source of an interrupt</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_MVLD1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_MVLD1</displayName>
          <description>Message Valid Register 1</description>
          <addressOffset>0x160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MsgVal16_1</name>
              <description>Message Valid Bits 16-1 (Of All Message Objects) (Read Only)\nEx. CAN_MVLD1[0] means Message object No.1 is valid or not. If CAN_MVLD1[0] is set, message object No.1 is configured.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>This Message Object is ignored by the Message Handler</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>This Message Object is configured and should be considered by the Message Handler</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_MVLD2</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_MVLD2</displayName>
          <description>Message Valid Register 2</description>
          <addressOffset>0x164</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MsgVal32_17</name>
              <description>Message Valid Bits 32-17 (Of All Message Objects) (Read Only)\nEx.CAN_MVLD2[15] means Message object No.32 is valid or not. If CAN_MVLD2[15] is set, message object No.32 is configured.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>This Message Object is ignored by the Message Handler</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>This Message Object is configured and should be considered by the Message Handler</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_WU_EN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_WU_EN</displayName>
          <description>Wake-up Enable Register</description>
          <addressOffset>0x168</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAKUP_EN</name>
              <description>Wake-Up Enable Control\nNote: User can wake-up system when there is a falling edge in the CAN_Rx pin.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CAN_WU_STATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CAN_WU_STATUS</displayName>
          <description>Wake-up Status Register</description>
          <addressOffset>0x16C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAKUP_STS</name>
              <description>Wake-Up Status \nNote: This bit can be cleared by writing '0'.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No wake-up event occurred</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Wake-up event occurred</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
